var express = require('express');
var router = express.Router();
// var db = require('../public/javascripts/db');


const conditionElectronic = {
    
    y2017 : {
        교필 : 11,
        교필_과목: [
            'English Listening Practice 1 -2',
            'English Reading Practice 1 -2',
            '문제해결을위한글쓰기와발표 -2',
            '서양철학:쟁점과토론 -2',
            '대학생활과진로설계 -1',
            '세종사회봉사1 -1',
            '취업역량개발론(->취창업과진로설계) -1'
        ],
        교선1 : 15,
        교선1_영역 : [
            '사상과역사',
            '사회와문화',
            '융합과창업',
            '자연과과학기술',
            '세계와지구촌'
        ],
        기교 : 18,
        기교_과목 : [
            '일변수미적분학',
            '공업수학1',
            '공업수학2',
            '일반물리학및실험1',
            '일반물리학및실험2',
            '일반화학',
        ],
        전필 : 42,
        전선 : 30,
        졸업학점 : 130

        },
    y2018 : {
        교필 : 13,
        교필_과목: [
            'English Listening Practice 1 -2',
            'English Reading Practice 1 -2',
            '문제해결을위한글쓰기와발표 -3',
            '서양철학:쟁점과토론 -3',
            '대학생활과진로설계 -1',
            '세종사회봉사1 -1',
            '취업역량개발론(->취창업과진로설계) -1'
        ],
        교선1 : 21,
        교선1_영역 : [
            '사상과역사',
            '사회와문화',
            '융합과창업',
            '자연과과학기술',
            '세계와지구촌'
        ],
        기교 : 18,
        기교_과목 : [
            '일변수미적분학',
            '공업수학1',
            '공업수학2',
            '일반물리학및실험1',
            '일반물리학및실험2',
            '일반화학',
        ],
        전필 : 42,
        전선 : 30,
        졸업학점 : 130
    },
    y2019 : {
        교필 : 14,
        교필_과목: [
            'English Listening Practice 1 -2',
            'English Reading Practice 1 -2',
            '문제해결을위한글쓰기와발표 -3',
            '서양철학:쟁점과토론 -3',
            '대학생활과진로설계 -1',
            '세종사회봉사1 -1',
            '창업과기업가정신1 -1',
            '취업역량개발론(->취창업과진로설계) -1'
        ],
        교선1 : 21,
        교선1_영역 : [
            '사상과역사',
            '사회와문화',
            '융합과창업',
            '자연과과학기술',
            '세계와지구촌'
        ],
        기교 : 18,
        기교_과목 : [
            '일변수미적분학',
            '공업수학1',
            '공업수학2',
            '일반물리학및실험1',
            '일반물리학및실험2',
            '일반화학',
        ],
        전필 : 42,
        전선 : 30,
        졸업학점 : 130
    },
    y2020 : {
        교필 : 14,
        교필_과목: [
            'English Listening Practice 1 -2',
            'English Reading Practice 1 -2',
            '문제해결을위한글쓰기와발표 -3',
            '서양철학:쟁점과토론 -3',
            '대학생활과진로설계 -1',
            '신입생세미나 -1',
            '창업과기업가정신1 -1',
            '취업역량개발론(->취창업과진로설계) -1'
        ],
        교선1 : 21,
        교선1_영역 : [
            '사상과역사',
            '사회와문화',
            '융합과창업',
            '자연과과학기술',
            '세계와지구촌'
        ],
        기교 : 18,
        기교_과목 : [
            '일변수미적분학',
            '공업수학1',
            '공업수학2',
            '일반물리학및실험1',
            '일반물리학및실험2',
            '일반화학',
        ],
        전필 : 42,
        전선 : 30,
        졸업학점 : 130
    },
    y2021 : {
        교필 : 14,
        교필_과목: [
            'English Listening Practice 1 -2',
            'English Reading Practice 1 -2',
            '문제해결을위한글쓰기와발표 -3',
            '서양철학:쟁점과토론 -3',
            '대학생활과진로탐색 -1',
            '신입생세미나 -1',
            '창업과기업가정신1 -1',
            '취업역량개발론(->취창업과진로설계) -1'
        ],
        교선1 : 21,
        교선1_영역 : [
            '사상과역사',
            '사회와문화',
            '융합과창업',
            '자연과과학기술',
            '세계와지구촌'
        ],
        기교 : 18,
        기교_과목 : [
            '일변수미적분학',
            '공업수학1',
            '공업수학2',
            '일반물리학및실험1',
            '일반물리학및실험2',
            '일반화학',
        ],
        전필 : 42,
        전선 : 30,
        졸업학점 : 130
    }



}
let conditionCommon = {
    영어졸업인증 : null,
    고전독서인증 : null
}

const conditionEngineering = {
    y2017 : {
        전문교양 : 16,
        전문교양_과목 : [
            'English Listening Practice 1',
            'English Listening Practice 2',
            'English Reading Practice 1',
            'English Reading Practice 2',
            '문제해결을위한글쓰기와발표',
            '세종사회봉사1',
            '서양철학:쟁점과토론',
            '세계사:인간과문명',
        ],
        MSC : 30,
        MSC_과목 : [
            '일변수미적분학',
            '공업수학1',
            '공업수학2',
            '선형대수',
            '확률및랜덤변수',
            '일반물리학및실험1',
            '일반물리학및실험2',
            '일반화학',
            '고급프로그래밍입문-C',
            '프로그래밍',
        ],
        전공 : 54,
        전공조건 : [
            '설계: 기초설계 -> 요소설계 (2과목 이수) -> 캡스톤 A or B',
            '실험 1과목 이상 이수',
            '일반영역 교과목 24학점 이상 이수',
            '선후수 지정 교과목 이수체계 준수'
        ],
        인증최소이수학점 : 100
    },
    y2018 : {
        전문교양 : 16,
        전문교양_과목 : [
            'English Listening Practice 1',
            'English Reading Practice 1',
            'English Reading Practice 2',
            '문제해결을위한글쓰기와발표',
            '세종사회봉사1',
            '서양철학:쟁점과토론',
            '세계사:인간과문명',
        ],
        MSC : 30,
        MSC_과목 : [
            '일변수미적분학',
            '공업수학1',
            '공업수학2',
            '선형대수',
            '확률및랜덤변수',
            '일반물리학및실험1',
            '일반물리학및실험2',
            '일반화학',
            '고급프로그래밍입문-C',
            '프로그래밍',
        ],
        전공 : 54,
        전공조건 : [
            '설계: 기초설계 -> 요소설계 (2과목 이수) -> 캡스톤 A or B',
            '실험 1과목 이상 이수',
            '일반영역 교과목 24학점 이상 이수',
            '선후수 지정 교과목 이수체계 준수'
        ],
        인증최소이수학점 : 100
    },
    y2019 : {
        전문교양 : 14,
        전문교양_과목 : [
            'English Listening Practice 1',
            'English Reading Practice 1',
            '문제해결을위한글쓰기와발표',
            '세종사회봉사1',
            '서양철학:쟁점과토론',
            '세계사:인간과문명',
        ],
        MSC : 30,
        MSC_과목 : [
            '일변수미적분학',
            '공업수학1',
            '공업수학2',
            '선형대수',
            '확률및랜덤변수',
            '일반물리학및실험1',
            '일반물리학및실험2',
            '일반화학',
            '고급프로그래밍입문-C',
            '프로그래밍',
        ],
        전공 : 54,
        전공조건 : [
            '설계: 기초설계 -> 요소설계 (2과목 이수) -> 캡스톤 A or B',
            '실험 1과목 이상 이수',
            '일반영역 교과목 24학점 이상 이수',
            '선후수 지정 교과목 이수체계 준수'
        ],
        인증최소이수학점 : 100
    },
    y2020 : {
        전문교양 : 14,
        전문교양_과목 : [
            'English Listening Practice 1',
            'English Reading Practice 1',
            '문제해결을위한글쓰기와발표',
            '세종사회봉사1',
            '서양철학:쟁점과토론',
            '세계사:인간과문명',
        ],
        MSC : 30,
        MSC_과목 : [
            '일변수미적분학',
            '공업수학1',
            '공업수학2',
            '선형대수',
            '확률및랜덤변수',
            '일반물리학및실험1',
            '일반물리학및실험2',
            '일반화학',
            '고급프로그래밍입문-C',
            '프로그래밍',
        ],
        전공 : 54,
        전공조건 : [
            '설계: 기초설계 -> 요소설계 (2과목 이수) -> 캡스톤 A or B',
            '실험 1과목 이상 이수',
            '일반영역 교과목 24학점 이상 이수',
            '선후수 지정 교과목 이수체계 준수'
        ],
        인증최소이수학점 : 100
    }
}













router.get('/', (req,res,next) =>{

    var list = '<div>';
    var i = 0;
    while (i < something.length){
        list += `
        <h2>${conditionCommon}</h2>
        <h4>${conditionCommon.교필[0]}</h4>
        `
        i++;
    }
    list = list + '</div>';

    var html = `
        <!doctype html>
        <html>
        <head>
            <title>GRADUATION</title>
            <meta charset="utf-8">
        </head>
        <body>
            <h1><a href="/">Graduation-CHECK</a></h1>
            <h2>중필 -> 교필, 중선 -> 교선1, 교양 -> 교선2</h2>
                ${list}
                <div>
                    <h2>전필</h2>
                    <h4>15/42</h4>
                </div>
                <div>
                    <h2>전선</h2>
                    <h4>15/30</h4>
                </div>
                <div>
                    <h2>교선1(=중선)</h2>
                    <h4>10/15</h4>
                </div>
                <div>
                    <h2>기교</h2>
                    <h4>15/18</h4>
                </div>
                <div>
                    <h2>교필</h2>
                    <h4>15/30</h4>
                </div>
                <div>
                    <h2>이수학점</h2>
                    <h4>100/130</h4>
                </div>
                <div>
                    <h2>봉사시간</h2>
                    <h4>15/30</h4>
                </div>
                <div>
                    <h2>영어인증</h2>
                    <h4>미완료</h4>
                </div>
                <div>
                    <h2>고전독서</h2>
                    <h4>동양 동서양 서양 과학사</h4>
                </div>
                <div>
                    <h2>공학인증</h2>
                    <h4>완료</h4>
                </div>
            
        </body>
        </html>
    `;
    res.send(html);
   
});
module.exports = router;
